//
//  Cities.swift
//  Bareuni
//
//  Created by 황인성 on 2023/08/10.
//

import Foundation


struct CityDictionary {
    let cityList = ["서울", "경기", "인천", "부산", "대구", "대전", "광주", "울산", "충남/세종", "충북", "전남", "전북", "경남", "경북", ]
    let cityDic = [
        "서울": ["강남구", "강동구", "강북구", "강서구", "관악구", "광진구", "구로구", "금천구", "노원구", "도봉구", "동대문구", "동작구", "마포구", "서대문구", "서초구", "성동구", "성북구", "송파구", "양천구", "영등포구", "용산구", "은평구", "중구", "종로구", "중랑구"],
        "경기": ["수원", "성남", "고양", "용인", "부천", "안산", "안양", "포천", "광명", "오산", "의정부", "시흥", "군포", "구리", "남양주", "광주", "하남", "김포", "의왕", "양주", "파주", "동두천", "연천", "가평", "여주", "이천", "안성", "평택", "화성", "용인"],
        "인천": ["중구", "동구", "남구", "연수구", "남동구", "부평구", "계양구", "서구", "강화군", "옹진군"],
        "부산": ["중구", "서구", "동구", "영도구", "부산진구", "동래구", "남구", "북구", "해운대구", "사하구", "금정구", "강서구", "연제구", "수영구", "사상구", "기장군"],
        "대구": ["중구", "동구", "서구", "남구", "북구", "수성구", "달서구", "달성군"],
        "대전": ["동구", "중구", "서구", "유성구", "대덕구"],
        "광주": ["동구", "서구", "남구", "북구", "광산구"],
        "울산": ["중구", "남구", "동구", "북구", "울주군"],
        "충남/세종": ["천안", "공주", "보령", "아산", "서산", "논산", "계룡", "당진", "금산", "부여", "서천", "청양", "홍성", "예산", "태안", "세종"],
        "충북": ["청주", "충주", "제천", "보은", "옥천", "영동", "진천", "괴산", "음성", "단양"],
        "전남": ["목포", "여수", "순천", "나주", "광양", "담양", "곡성", "구례", "고흥", "보성", "화순", "장흥", "강진", "해남", "영암", "무안", "함평", "영광", "장성", "완도", "진도", "신안"],
        "전북": ["전주", "익산", "군산", "정읍", "남원", "김제", "완주", "진안", "무주", "장수", "임실", "순창", "고창", "부안"],
        "경남": ["창원", "진주", "통영", "사천", "김해", "밀양", "거제", "양산", "의령", "함안", "창녕", "고성", "남해", "하동", "산청", "함양", "거창", "합천"],
        "경북": ["대구", "포항", "경주", "김천", "안동", "구미", "영주", "영천", "상주", "문경", "경산", "군위", "의성", "청송", "영양", "영덕", "청도", "고령", "성주", "칠곡", "예천", "봉화", "울진", "울릉"],
    ]
}
